EAtest/T12/background/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    oversetPatch
    {
        type            overset;
    }

    sides
    {
        type            empty;
    }
	
    inlet
    {
        type            fixedFluxPressure;
    }
	
    outlet
    {
        type            fixedFluxPressure;
    }

    ground
    {
        type            fixedFluxPressure;
    }
	
    atmosphere
    {
        type            totalPressure;
        p0              uniform 0;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           1;
        value           uniform 0;
    }
    floatingObject
    {
        type            fixedFluxPressure;
    }

    overset
    {
        patchType       overset;
        type            fixedFluxPressure;
    }
	sides1
    {
	patchType	overset;
	type		fixedFluxPressure;
    }
}

// ************************************************************************* //
